import React, { useEffect, useRef } from 'react';
import { Outlet, Link, useLocation } from 'react-router-dom';
import { ResentlyViewed, Navigation, Separator, Path } from './main';
import Flickity from 'flickity';
import 'flickity/css/flickity.css';

export function Question(props) {
    return <div style={{ marginTop: props.mTop }}>
        <h3 className='title' style={{ color: '#B53535', width: '1520px', margin: '0' }}>{props.question}</h3>
        <p style={{ color: '#686868', width: '1520px', margin: '14px 0 0 0', whiteSpace: 'pre-line' }}>{props.answer}</p>
    </div>
}

export function Genre(props) {
    return <main>
        {/* <img src='/booksBags.png' alt='bags' style={{ position: 'absolute', top: '2756px', left: '80px' }}></img> */}
        <div className='wrapper'>
            <Navigation></Navigation>
            <div style={{ display: 'flex', flexDirection: 'column', alignContent: 'center', flexWrap: 'wrap' }}>
                <Path width='1040px' mTop='0'></Path>

            </div>
        </div>
        <ResentlyViewed></ResentlyViewed>
        <section style={{ marginTop: '100px', display: 'flex', flexDirection: 'column', alignItems: 'center', marginBottom: '81px' }}>
            <Separator color='#D6D9DC'></Separator>
            <Question question="Психологічні трилери: для тих, хто хоче полоскотати нерви" answer="Трилер — популярний різновид літератури, головна мета якого — змусити читача відчути тривожне очікування, нервове хвилювання та неконтрольований страх. Попри те, що страшні сюжети викликають у людини негативні емоції, коло шанувальників подібного літературного жанру постійно розширюється. Все тому, що цікаві книги трилери — це завжди динамічно, непередбачувано та неймовірно цікаво." mTop="82px"></Question>
            <Question question="Страшні внутрішні демони роду Homo sapiens" answer="Не слід плутати трилери з класичними жахами. Дуже часто містичний складник зовсім відсутній у психологічній літературі. Сюжети, що описують страшні книги трилери, — це, як правило, реальні та правдиві історії з життя звичайних людей. Сутінки нашої підсвідомості приховують багато таємниць. Іноді ми самі не здогадуємося, як далеко можемо зайти заради власних бажань." mTop="100px"></Question>
            <Question
                question="Чому ж не почати читати трилери українською мовою?"
                answer={`Варто хоч раз купити психологічні трилери, і ви більше не зможете зупинитися. Динамічний розвиток подій ні на хвилину не дає читачеві розслабитися, а фінал трилерів завжди важко передбачити. Психологічні романи описують потаємні закутки людської душі. І ніби з хірургічною точністю розкривають усі приховані там таємниці та загадки.

В інтернет-магазині «КСД» будь-який поціновувач трилерів знайде щось цікаве для себе. У віртуальному каталозі представлені трилери українською мовою від всесвітньо відомих письменників: книги С. Кінга — короля жахів, Т. Ґеррітсен — авторки медичних та романтичних трилерів, Д. Кунца — майстра саспенсу (тривожного очікування).

Також ви можете купити українські книги трилери, наприклад, романи письменника Макса Кідрука. Шанувальникам класичних історій, які екранізували голлівудські режисери, обов'язково сподобається роман «Екзорцист» В. Пітера Блетті або «Адвокат диявола» Е. Нейдермана.

В нашому інтернет-магазині широкий вибір трилерів різної цінової категорії. Ми постійно проводимо акції, щоб зробити книги доступними кожному українцю. Тож чекаємо на ваші замовлення!`}
                mTop="100px"
            />
        </section>


    </main>
}